yashagarwal-314/Blue_Wedge/motorbench_FOC_PLL_dsPIC33CK_MCLV_48_300_ACT57BLF02.X/motorbench_FOC_PLL_dsPIC33CK_MCLV_48_300_delonghi.X/mcc_generated_files/adc/adc1.h
/**
 * ADC1 Generated Driver Header File
 * 
 * @file      adc1.h
 *            
 * @ingroup   adcdriver
 *            
 * @brief     This is the generated driver header file for the ADC1 driver
 *            
 * @skipline @version   Firmware Driver Version 1.4.4
 *
 * @skipline @version   PLIB Version 2.4.3
 *            
 * @skipline  Device : dsPIC33CK256MP508
*/

/*
© [2024] Microchip Technology Inc. and its subsidiaries.

    Subject to your compliance with these terms, you may use Microchip 
    software and any derivatives exclusively with Microchip products. 
    You are responsible for complying with 3rd party license terms  
    applicable to your use of 3rd party software (including open source  
    software) that may accompany Microchip software. SOFTWARE IS ?AS IS.? 
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS 
    SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,  
    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT 
    WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY 
    KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF 
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE 
    FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP?S 
    TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL NOT 
    EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR 
    THIS SOFTWARE.
*/

#ifndef ADC1_H
#define ADC1_H

// Section: Included Files

#include <xc.h>
#include <stdbool.h>
#include <stdint.h>
#include "adc_types.h"
#include "adc_interface.h"
#ifdef __cplusplus  //Provide C++ Compatibility

    extern "C" {

#endif

// Section: Data Types

/** 
  @ingroup  adcdriver
  @brief    Defines the scan option selection done for the shared channels
*/
#define ADC1_SCAN_MODE_SELECTED true

/** 
  @ingroup  adcdriver
  @brief    Defines the ADC Resolution
*/
#define ADC1_RESOLUTION 12

// Section: Data Type Definitions

/**
 * @ingroup  adcdriver
 * @brief    Structure object of type ADC_INTERFACE with the custom name
 *           given by the user in the Melody Driver User interface. The default name 
 *           e.g. ADC1 can be changed by the user in the ADC user interface. 
 *           This allows defining a structure with application specific name using 
 *           the 'Custom Name' field. Application specific name allows the API Portability.
*/
extern const struct ADC_INTERFACE MCC_ADC;

/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_Initialize API
 */
#define MCC_ADC_Initialize ADC1_Initialize
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_Deinitialize API
 */
#define MCC_ADC_Deinitialize ADC1_Deinitialize
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_Enable API
 */
#define MCC_ADC_Enable ADC1_Enable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_Disable API
 */
#define MCC_ADC_Disable ADC1_Disable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_SoftwareTriggerEnable API
 */
#define MCC_ADC_SoftwareTriggerEnable ADC1_SoftwareTriggerEnable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_SoftwareTriggerDisable API
 */
#define MCC_ADC_SoftwareTriggerDisable ADC1_SoftwareTriggerDisable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_ChannelSelect API
 */
#define MCC_ADC_ChannelSelect ADC1_ChannelSelect
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_ConversionResultGet API
 */
#define MCC_ADC_ConversionResultGet ADC1_ConversionResultGet
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_IsConversionComplete API
 */
#define MCC_ADC_IsConversionComplete ADC1_IsConversionComplete
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_ResolutionSet API
 */
#define MCC_ADC_ResolutionSet ADC1_ResolutionSet
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_InterruptEnable API
 */
#define MCC_ADC_InterruptEnable ADC1_InterruptEnable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_InterruptDisable API
 */
#define MCC_ADC_InterruptDisable ADC1_InterruptDisable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_InterruptFlagClear API
 */
#define MCC_ADC_InterruptFlagClear ADC1_InterruptFlagClear
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_InterruptPrioritySet API
 */
#define MCC_ADC_InterruptPrioritySet ADC1_InterruptPrioritySet
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_CommonCallbackRegister API
 */
#define MCC_ADC_CommonCallbackRegister ADC1_CommonCallbackRegister
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_Tasks API
 */
#define MCC_ADC_Tasks ADC1_Tasks
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_IndividualChannelInterruptEnable API
 */
#define MCC_ADC_IndividualChannelInterruptEnable ADC1_IndividualChannelInterruptEnable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_IndividualChannelInterruptDisable API
 */
#define MCC_ADC_IndividualChannelInterruptDisable ADC1_IndividualChannelInterruptDisable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_IndividualChannelInterruptFlagClear API
 */
#define MCC_ADC_IndividualChannelInterruptFlagClear ADC1_IndividualChannelInterruptFlagClear
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_IndividualChannelInterruptPrioritySet API
 */
#define MCC_ADC_IndividualChannelInterruptPrioritySet ADC1_IndividualChannelInterruptPrioritySet
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_ChannelCallbackRegister API
 */
#define MCC_ADC_ChannelCallbackRegister ADC1_ChannelCallbackRegister
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_ComparatorCallbackRegister API
 */
#define MCC_ADC_ComparatorCallbackRegister ADC1_ComparatorCallbackRegister
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_ChannelTasks API
 */
#define MCC_ADC_ChannelTasks ADC1_ChannelTasks
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_CorePowerEnable API
 */
#define MCC_ADC_CorePowerEnable ADC1_CorePowerEnable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_SharedCorePowerEnable API
 */
#define MCC_ADC_SharedCorePowerEnable ADC1_SharedCorePowerEnable
/**
 * @ingroup  adcdriver
 * @brief    This macro defines the Custom Name for \ref ADC1_PWMTriggerSourceSet API
 */
#define MCC_ADC_PWMTriggerSourceSet ADC1_PWMTriggerSourceSet

// Section: Driver Interface Functions

/**
 * @ingroup  adcdriver
 * @brief    Initializes ADC1 module, using the given initialization data
 *           This function must be called before any other ADC1 function is called
 * @param    none
 * @return   none  
 */
void ADC1_Initialize (void);

/**
 * @ingroup  adcdriver
 * @brief    Deinitializes the ADC1 to POR values
 * @param    none
 * @return   none  
 */
void ADC1_Deinitialize(void);

/**
 * @ingroup  adcdriver
 * @brief    This inline function enables the ADC1 module
 * @pre      \ref ADC1_Initialize function should have been 
 *           called  before calling this function.
 * @param    none
 * @return   none  
 */
inline static void ADC1_Enable(void)
{
   ADCON1Lbits.ADON = 1;
}

/**
 * @ingroup  adcdriver
 * @brief    This inline function disables the ADC1 module
 * @pre      \ref ADC1_Initialize function should have been 
 *           called  before calling this function.
 * @param    none
 * @return   none  
 */
inline static void ADC1_Disable(void)
{
   ADCON1Lbits.ADON = 0;
}

/**
 * @ingroup  adcdriver
 * @brief    This inline function sets software common trigger
 * @pre      \ref ADC1_Initialize function should have been 
 *           called before calling this function.
 * @param    none
 * @return   none  
 */
inline static void ADC1_SoftwareTriggerEnable(void)
{
   ADCON3Lbits.SWCTRG = 1;
}

/**
 * @ingroup  adcdriver
 * @brief    This inline function resets software common trigger
 * @pre      ADC1_Initialize function should have been 
 *           called before calling this function.
 * @param    none
 * @return   none  
 */
inline static void ADC1_SoftwareTriggerDisable(void)
{
   ADCON3Lbits.SWCTRG = 0;
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function allows selection of a channel for conversion
 * @pre        \ref ADC1_Initialize() function should have been
 *             called before calling this function.
 * @param[in]  channel - Channel for conversion  
 * @return     none  
 */
inline static void ADC1_ChannelSelect( enum ADC_CHANNEL channel )
{
    //This function does not have any implementation since 
    //Shared channels are selected from UI.
    //Dedicated channels are selected from UI.
    
    (void)channel;
}

/**
 * @ingroup    adcdriver
 * @brief      Returns the conversion value for the channel selected
 * @pre        This inline function returns the conversion value only after the conversion is complete. 
 *             Conversion completion status can be checked using 
 *             \ref ADC1_IsConversionComplete(channel) function.
 * @param[in]  channel - Selected channel  
 * @return     Returns the analog to digital converted value  
 */
inline static uint16_t ADC1_ConversionResultGet( enum ADC_CHANNEL channel )
{
    uint16_t result = 0x0U;

    switch(channel)
    {
        case MCAF_ADC_PHASEB_CURRENT:
                result = ADCBUF4;
                break;
        case MCAF_ADC_ABSREF_VOLTAGE:
                result = ADCBUF6;
                break;
        case MCAF_ADC_PHASEA_VOLTAGE:
                result = ADCBUF10;
                break;
        case MCAF_ADC_PHASEB_VOLTAGE:
                result = ADCBUF11;
                break;
        case MCAF_ADC_PHASEC_VOLTAGE:
                result = ADCBUF12;
                break;
        case MCAF_ADC_DCLINK_VOLTAGE:
                result = ADCBUF15;
                break;
        case MCAF_ADC_PHASEC_CURRENT:
                result = ADCBUF16;
                break;
        case MCAF_ADC_POTENTIOMETER:
                result = ADCBUF17;
                break;
        case MCAF_ADC_BRIDGE_TEMPERATURE:
                result = ADCBUF18;
                break;
        case MCAF_ADC_DCLINK_CURRENT:
                result = ADCBUF0;
                break;
        case MCAF_ADC_PHASEA_CURRENT:
                result = ADCBUF1;
                break;
        default:
                break;
    }
    return result;
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function returns the status of conversion.This function is used to 
 *             determine if conversion is completed. When conversion is complete 
 *             the function returns true otherwise false.
 * 
 * @pre        \ref ADC1_SoftwareTriggerEnable() function should have been 
 *             called before calling this function.
 * @param[in]  channel - Selected channel  
 * @return     true - Conversion is complete.
 * @return     false - Conversion is not complete.  
 */
inline static bool ADC1_IsConversionComplete(enum ADC_CHANNEL channel)
{
    bool status = false;

    switch(channel)
    {
        case MCAF_ADC_PHASEB_CURRENT:
                status = ADSTATLbits.AN4RDY;
                break;
        case MCAF_ADC_ABSREF_VOLTAGE:
                status = ADSTATLbits.AN6RDY;
                break;
        case MCAF_ADC_PHASEA_VOLTAGE:
                status = ADSTATLbits.AN10RDY;
                break;
        case MCAF_ADC_PHASEB_VOLTAGE:
                status = ADSTATLbits.AN11RDY;
                break;
        case MCAF_ADC_PHASEC_VOLTAGE:
                status = ADSTATLbits.AN12RDY;
                break;
        case MCAF_ADC_DCLINK_VOLTAGE:
                status = ADSTATLbits.AN15RDY;
                break;
        case MCAF_ADC_PHASEC_CURRENT:
                status = ADSTATHbits.AN16RDY;
                break;
        case MCAF_ADC_POTENTIOMETER:
                status = ADSTATHbits.AN17RDY;
                break;
        case MCAF_ADC_BRIDGE_TEMPERATURE:
                status = ADSTATHbits.AN18RDY;
                break;
        case MCAF_ADC_DCLINK_CURRENT:
                status = ADSTATLbits.AN0RDY;
                break;
        case MCAF_ADC_PHASEA_CURRENT:
                status = ADSTATLbits.AN1RDY;
                break;
        default:
                break;
    }

