yashagarwal-314/Blue_Wedge/motorbench_FOC_PLL_dsPIC33CK_MCLV_48_300_ACT57BLF02.X/motorbench_FOC_PLL_dsPIC33CK_MCLV_48_300_delonghi.X/mcc_generated_files/adc/adc1.h
    return status;
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function helps to configure all cores with same resolution
 * 
 * @param[in]  resolution - Resolution type  
 * @return     none 
 */
inline static void ADC1_ResolutionSet(enum ADC_RESOLUTION_TYPE resolution)
{
   ADCORE0Hbits.RES = resolution;
   ADCORE1Hbits.RES = resolution;
   ADCON1Hbits.SHRRES = resolution;
}

/**
 * @ingroup  adcdriver
 * @brief    This inline function enables the ADC1 interrupt
 * @param    none
 * @return   none  
 */
inline static void ADC1_InterruptEnable(void)
{
    IEC5bits.ADCIE = 1;
}

/**
 * @ingroup  adcdriver
 * @brief    This inline function disables the ADC1 interrupt
 * @param    none
 * @return   none  
 */
inline static void ADC1_InterruptDisable(void)
{
    IEC5bits.ADCIE = 0;
}

/**
 * @ingroup  adcdriver
 * @brief    Clears interrupt flag manually
 * @param    none
 * @return   none  
 */
inline static void ADC1_InterruptFlagClear(void)
{
    IFS5bits.ADCIF = 0;
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function allows selection of priority for interrupt
 * @param[in]  priorityValue  -  The numerical value of interrupt priority
 * @return     none  
 */
inline static void ADC1_InterruptPrioritySet( uint16_t priorityValue )
{
    IPC22bits.ADCIP = (uint16_t)0x7 & priorityValue;
}

/**
 * @ingroup    adcdriver
 * @brief      This function can be used to override default callback and to 
 *             define custom callback for ADC1 Common event
 * @param[in]  callback - Address of the callback function.  
 * @return     none  
 *             
 */
void ADC1_CommonCallbackRegister(void(*callback)(void));

/**
 * @ingroup  adcdriver
 * @brief    This is the default callback with weak attribute. The user can override and implement the default callback without weak attribute
 *           or can register a custom callback function using  ADC1_CommonCallbackRegister
 * @param    none
 * @return   none  
 */
void ADC1_CommonCallback(void);

 
/**
 * @ingroup  adcdriver
 * @brief    This function is used to implement the tasks for polled implementations
 * @pre      \ref ADC1_Initialize() function should have been
 *           called before calling this function.
 * @param    none
 * @return   none
 * @note     This function has to be polled to notify callbacks and clear 
 *           the interrupt flags in non-interrupt mode of ADC
 */
void ADC1_Tasks(void);

/**
 * @ingroup    adcdriver
 * @brief      This inline function enables individual channel interrupt
 * @param[in]  channel - Selected channel  
 * @return     none  
 */
inline static void ADC1_IndividualChannelInterruptEnable(enum ADC_CHANNEL channel)
{
    switch(channel)
    {
        case MCAF_ADC_PHASEB_CURRENT:
                IEC5bits.ADCAN4IE = 1;
                ADIELbits.IE4 = 1;
                break;
        case MCAF_ADC_ABSREF_VOLTAGE:
                IEC6bits.ADCAN6IE = 1;
                ADIELbits.IE6 = 1;
                break;
        case MCAF_ADC_PHASEA_VOLTAGE:
                IEC6bits.ADCAN10IE = 1;
                ADIELbits.IE10 = 1;
                break;
        case MCAF_ADC_PHASEB_VOLTAGE:
                IEC6bits.ADCAN11IE = 1;
                ADIELbits.IE11 = 1;
                break;
        case MCAF_ADC_PHASEC_VOLTAGE:
                IEC6bits.ADCAN12IE = 1;
                ADIELbits.IE12 = 1;
                break;
        case MCAF_ADC_DCLINK_VOLTAGE:
                IEC6bits.ADCAN15IE = 1;
                ADIELbits.IE15 = 1;
                break;
        case MCAF_ADC_PHASEC_CURRENT:
                IEC6bits.ADCAN16IE = 1;
                ADIEHbits.IE16 = 1;
                break;
        case MCAF_ADC_POTENTIOMETER:
                IEC6bits.ADCAN17IE = 1;
                ADIEHbits.IE17 = 1;
                break;
        case MCAF_ADC_BRIDGE_TEMPERATURE:
                IEC6bits.ADCAN18IE = 1;
                ADIEHbits.IE18 = 1;
                break;
        case MCAF_ADC_DCLINK_CURRENT:
                IEC5bits.ADCAN0IE = 1;
                ADIELbits.IE0 = 1;
                break;
        case MCAF_ADC_PHASEA_CURRENT:
                IEC5bits.ADCAN1IE = 1;
                ADIELbits.IE1 = 1;
                break;
        default:
                break;
    }
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function disables individual channel interrupt
 * @param[in]  channel - Selected channel  
 * @return     none  
 */
inline static void ADC1_IndividualChannelInterruptDisable(enum ADC_CHANNEL channel)
{
    switch(channel)
    {
        case MCAF_ADC_PHASEB_CURRENT:
                IEC5bits.ADCAN4IE = 0;
                ADIELbits.IE4 = 0;
                break;
        case MCAF_ADC_ABSREF_VOLTAGE:
                IEC6bits.ADCAN6IE = 0;
                ADIELbits.IE6 = 0;
                break;
        case MCAF_ADC_PHASEA_VOLTAGE:
                IEC6bits.ADCAN10IE = 0;
                ADIELbits.IE10 = 0;
                break;
        case MCAF_ADC_PHASEB_VOLTAGE:
                IEC6bits.ADCAN11IE = 0;
                ADIELbits.IE11 = 0;
                break;
        case MCAF_ADC_PHASEC_VOLTAGE:
                IEC6bits.ADCAN12IE = 0;
                ADIELbits.IE12 = 0;
                break;
        case MCAF_ADC_DCLINK_VOLTAGE:
                IEC6bits.ADCAN15IE = 0;
                ADIELbits.IE15 = 0;
                break;
        case MCAF_ADC_PHASEC_CURRENT:
                IEC6bits.ADCAN16IE = 0;
                ADIEHbits.IE16 = 0;
                break;
        case MCAF_ADC_POTENTIOMETER:
                IEC6bits.ADCAN17IE = 0;
                ADIEHbits.IE17 = 0;
                break;
        case MCAF_ADC_BRIDGE_TEMPERATURE:
                IEC6bits.ADCAN18IE = 0;
                ADIEHbits.IE18 = 0;
                break;
        case MCAF_ADC_DCLINK_CURRENT:
                IEC5bits.ADCAN0IE = 0;
                ADIELbits.IE0 = 0;
                break;
        case MCAF_ADC_PHASEA_CURRENT:
                IEC5bits.ADCAN1IE = 0;
                ADIELbits.IE1 = 0;
                break;
        default:
                break;
    }
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function clears individual channel interrupt flag
 * @param[in]  channel - Selected channel  
 * @return     none  
 */
inline static void ADC1_IndividualChannelInterruptFlagClear(enum ADC_CHANNEL channel)
{
    switch(channel)
    {
        case MCAF_ADC_PHASEB_CURRENT:
                IFS5bits.ADCAN4IF = 0;
                break;
        case MCAF_ADC_ABSREF_VOLTAGE:
                IFS6bits.ADCAN6IF = 0;
                break;
        case MCAF_ADC_PHASEA_VOLTAGE:
                IFS6bits.ADCAN10IF = 0;
                break;
        case MCAF_ADC_PHASEB_VOLTAGE:
                IFS6bits.ADCAN11IF = 0;
                break;
        case MCAF_ADC_PHASEC_VOLTAGE:
                IFS6bits.ADCAN12IF = 0;
                break;
        case MCAF_ADC_DCLINK_VOLTAGE:
                IFS6bits.ADCAN15IF = 0;
                break;
        case MCAF_ADC_PHASEC_CURRENT:
                IFS6bits.ADCAN16IF = 0;
                break;
        case MCAF_ADC_POTENTIOMETER:
                IFS6bits.ADCAN17IF = 0;
                break;
        case MCAF_ADC_BRIDGE_TEMPERATURE:
                IFS6bits.ADCAN18IF = 0;
                break;
        case MCAF_ADC_DCLINK_CURRENT:
                IFS5bits.ADCAN0IF = 0;
                break;
        case MCAF_ADC_PHASEA_CURRENT:
                IFS5bits.ADCAN1IF = 0;
                break;
        default:
                break;
    }
}

/**
 * @ingroup    adcdriver
 * @brief      This inline function allows selection of priority for individual channel interrupt
 * @param[in]  channel - Selected channel 
 * @param[in]  priorityValue  -  The numerical value of interrupt priority
 * @return     none  
 */
inline static void ADC1_IndividualChannelInterruptPrioritySet(enum ADC_CHANNEL channel, enum INTERRUPT_PRIORITY priorityValue)
{
	switch(channel)
	{
		case MCAF_ADC_PHASEB_CURRENT:
				IPC23bits.ADCAN4IP = priorityValue;
				break;
		case MCAF_ADC_ABSREF_VOLTAGE:
				IPC24bits.ADCAN6IP = priorityValue;
				break;
		case MCAF_ADC_PHASEA_VOLTAGE:
				IPC25bits.ADCAN10IP = priorityValue;
				break;
		case MCAF_ADC_PHASEB_VOLTAGE:
				IPC25bits.ADCAN11IP = priorityValue;
				break;
		case MCAF_ADC_PHASEC_VOLTAGE:
				IPC25bits.ADCAN12IP = priorityValue;
				break;
		case MCAF_ADC_DCLINK_VOLTAGE:
				IPC26bits.ADCAN15IP = priorityValue;
				break;
		case MCAF_ADC_PHASEC_CURRENT:
				IPC26bits.ADCAN16IP = priorityValue;
				break;
		case MCAF_ADC_POTENTIOMETER:
				IPC27bits.ADCAN17IP = priorityValue;
				break;
		case MCAF_ADC_BRIDGE_TEMPERATURE:
				IPC27bits.ADCAN18IP = priorityValue;
				break;
		case MCAF_ADC_DCLINK_CURRENT:
				IPC22bits.ADCAN0IP = priorityValue;
				break;
		case MCAF_ADC_PHASEA_CURRENT:
				IPC23bits.ADCAN1IP = priorityValue;
				break;
		default:
				break;
	}
}

/**
 * @ingroup    adcdriver
 * @brief      This function can be used to override default callback \ref ADC1_ChannelCallback
 *             and to define custom callback for ADC1 Channel event. 
 *             Read the conversion result of the corresponding channel in the custom callback.
 * @param[in]  callback - Address of the callback function.  
 * @return     none  
 */
void ADC1_ChannelCallbackRegister(void(*callback)(enum ADC_CHANNEL channel, uint16_t adcVal));

/**
 * @ingroup    adcdriver
 * @brief      This is the default callback function for all the analog channels. 
 *             This callback is triggered once the channel conversion is done for a
 *             channel and to read the conversion result of the corresponding channel
 * @param[in]  channel - conversion completed channel
 * @param[in]  adcVal - conversion result of channel  
 * @return     none  
 */
void ADC1_ChannelCallback(enum ADC_CHANNEL channel, uint16_t adcVal);


/**
 * @ingroup    adcdriver
 * @brief      This function can be used to override default callback and to 
 *             define custom callback for ADC1_Comparator event
 * @param[in]  callback - Address of the callback function.  
 * @return     none  
 */
void ADC1_ComparatorCallbackRegister(void(*callback)(enum ADC_CMP comparator));

/**
 * @ingroup    adcdriver
 * @brief      Comparator callback function
 * @param[in]  comparator - comparator in which compare event occurred  
 * @return     none  
 */
void ADC1_ComparatorCallback(enum ADC_CMP comparator);


/**
 * @ingroup    adcdriver
 * @brief      This function call used only in polling mode, if channel 
 *             conversion is done for requested channel, the calls the 
 *             respective callback function
 * @pre        \ref ADC1_Initialize() function should have been  
 *             called before calling this function.
 * @param[in]  channel - Selected channel.  
 * @return     none  
 * @note       This function has to be polled to notify channel callbacks and clear 
 *             the channel interrupt flags in non-interrupt mode of ADC
 */
void ADC1_ChannelTasks(enum ADC_CHANNEL channel);


// Section: Interface functions: Dedicated Core

/**
 * @ingroup    adcdriver
 * @brief      Enables analog and digital power for ADC1 dedicated core
 * @param[in]  core - Selected core  
 * @return     none  
 */
void ADC1_CorePowerEnable(enum ADC_DEDICATED_CORE core);


/**
 * @ingroup  adcdriver
 * @brief    Enables power for ADC1 shared Core
 *           This function is used to set the analog and digital power for 
 *           ADC1 shared Core.
 * @param    none
 * @return   none  
 */
void ADC1_SharedCorePowerEnable(void);


/**
 * @ingroup  adcdriver
 * @brief    Sets PWM trigger source for corresponding analog input 
 * @param[in]  channel - Selected channel  
 * @param[in]  pwmInstance - PWM instance for the trigger source
 * @param[in]  triggerNumber - 1, for PWMx Trigger 1
 * @param[in]  triggerNumber - 2, for PWMx Trigger 2
 * @return   none  
 * @note     Configure PWM trigger value using \ref PWM_TriggerACompareValueSet, \ref PWM_TriggerBCompareValueSet
 *           or \ref PWM_TriggerCCompareValueSet before calling this funcion and enable corresponding 
 *           PWM trigger using \ref PWM_Trigger1Enable or \ref PWM_Trigger2Enable post calling it.
 */
void ADC1_PWMTriggerSourceSet(enum ADC_CHANNEL channel, enum ADC_PWM_INSTANCE pwmInstance, enum ADC_PWM_TRIGGERS triggerNumber);

#ifdef __cplusplus  // Provide C++ Compatibility

    }

#endif

#endif //_ADC1_H
    
/**
 End of File
*/

